{
  "profile": {
    "height": "180",
    "weight": "67.5",
    "fat": "14.2%",
    "muscle": "35.0"
  },
  "habits": [
    {
      "title": "💧 Hidratación",
      "text": "Beber al menos 2-3 litros de agua al día."
    },
    {
      "title": "😴 Descanso de Calidad",
      "text": "Dormir entre 7-8 horas cada noche para una recuperación óptima."
    },
    {
      "title": "🧘‍♂️ Mindfulness y Estrés",
      "text": "Dedicar 10 minutos al día a meditar o a la relajación para controlar el estrés."
    },
    {
      "title": "🏃‍♂️ Cardio Regular",
      "text": "Realizar 30-45 minutos de cardio moderado 3-4 veces por semana."
    },
    {
      "title": "🤸‍♂️ Flexibilidad y Movilidad",
      "text": "Dedicar 10-15 minutos después de cada entrenamiento a estiramientos."
    },
    {
      "title": "🥗 Planificación de Comidas",
      "text": "Preparar las comidas de la semana con antelación (Meal Prep) para asegurar la adherencia a la dieta."
    },
    {
      "title": "📵 Desconexión Digital",
      "text": "Limitar el uso de pantallas al menos 1 hora antes de dormir para mejorar la calidad del sueño."
    }
  ],
  "diet": {
    "LUNES": [
      {"meal": "DESAYUNO", "ingredients": "Avena Proteica con Frutos Rojos y Cacahuete: 60g avena, 1 scoop proteína, 10g cacahuete en polvo, 200ml agua/leche vegetal, 50g arándanos.", "recipe": "Calienta la avena con agua/leche vegetal hasta que espese. Retira del fuego, añade la proteína en polvo y el cacahuete en polvo, mezcla bien. Incorpora los arándanos por encima.", "notes": ""},
      {"meal": "ALMUERZO", "ingredients": "Batido Proteico Mercadona y Almendras: 1 Batido Proteico Mercadona, 15g almendras.", "recipe": "Listo para consumir", "notes": ""},
      {"meal": "COMIDA", "ingredients": "Pavo Salteado con Quinoa y Calabacín: 200-220g pavo picado, 50g quinoa (crudo), 250g calabacín, 50g cebolla, 15g AOVE.", "recipe": "Cocina la quinoa según las instrucciones. Pica la cebolla y el calabacín. En una sartén, saltea la cebolla con 10g de AOVE, añade el pavo picado y cocina hasta que esté dorado. Incorpora el calabacín y cocina hasta que esté tierno. Mezcla con la quinoa cocida y los otros 5g de AOVE, sazona con sal y especias.", "notes": "<strong style='color:#B8860B'>Guiso de Lentejas con Pavo y Verduras</strong><br><span style='color:#B8860B'>Ingredientes:</span> 100g de lentejas pardinas (en crudo), 150g de pavo picado, 150g de verduras para guiso (zanahoria, cebolla, pimiento), 5g de AOVE, especias.<br><span style='color:#B8860B'>Preparación:</span> Sofríe las verduras en la Thermomix, añade el pavo picado y sofríe un poco más. Añade las lentejas, agua y especias. Cocina a 100°C, velocidad cuchara, durante 30-40 minutos."},
      {"meal": "MERIENDA", "ingredients": "Batido de Proteína y Tortitas de Arroz con Crema de Cacahuete: 1 scoop proteína, agua, 3 tortitas de arroz, 20g crema de cacahuete.", "recipe": "Mezcla la proteína en polvo con agua en un shaker. Unta las tortitas de arroz con la crema de cacahuete. Consume el batido y las tortitas.", "notes": ""},
      {"meal": "CENA", "ingredients": "Tortilla de Patatas \"Saludable\": 3 huevos enteros, 100g patatas cocidas, 50g cebolla, 10g AOVE, sal.", "recipe": "Pica cebolla y saltea con 5g de AOVE. Añade las patatas cocidas y troceadas, dora ligeramente. Bate los huevos con sal, añade las patatas y cebolla. Vierte la mezcla en la sartén con los otros 5g de AOVE y cuaja la tortilla.", "notes": ""}
    ],
    "MARTES": [
        {"meal": "DESAYUNO", "ingredients": "Huevos Revueltos con Champiñones y cebolla: 3 huevos enteros, 150g champiñones, 100g cebolla, 2 rebanadas pan integral (60g), 5g AOVE.", "recipe": "Lava y corta los champiñones. Saltea los champiñones en una sartén con 5g de AOVE hasta que suelten agua, añade las espinacas hasta que se reduzcan. Bate los huevos con sal y pimienta, viértelos en la sartén y revuelve hasta que estén cocidos. Tuesta el pan integral y rocía con los otros 5g de AOVE. Sirve los huevos con las verduras y el pan.", "notes": ""},
        {"meal": "ALMUERZO", "ingredients": "Yogur Proteico Mercadona y Manzana: 1 Yogur Proteico Mercadona, 1 manzana.", "recipe": "Listo para consumir", "notes": ""},
        {"meal": "COMIDA", "ingredients": "Burrito Bowl Casero \"Deconstruido\": 200g ternera (95% magra), 100g arroz integral, 50 g de cebolla. 200g calabacín, 10g AOVE. Para el aderezo: 100g de yogur griego natural, zumo de medio limón.", "recipe": "Cocina el arroz. En una sartén, sofríe la cebolla con 5g de AOVE. Añade la carne y las especias, cocina. Ralla el calabacín e incorpóralo. Sirve el arroz como base en un bol, añade la mezcla de carne y verduras. Adereza con el yogur griego y un poco de zumo de limón si quieres.", "notes": "<strong style='color:#B8860B'>Patata asada con huevo</strong><br><span style='color:#B8860B'>Ingredientes:</span> 200g de patata, 2 huevos, 10g de AOVE, sal y especias.<br><span style='color:#B8860B'>Preparación:</span> Envuelve la patata en papel de aluminio y ásala en la AirFryer. Haz los huevos a la plancha. Abre la patata y añade los huevos, el AOVE y especias."},
        {"meal": "MERIENDA", "ingredients": "Plátano y Nueces: 1 plátano, 20g nueces.", "recipe": "Listo para consumir", "notes": ""},
        {"meal": "CENA", "ingredients": "Merluza al Vapor con Coliflor y Zanahorias: 200g merluza, 250g coliflor, 200g zanahorias, 5g AOVE.", "recipe": "Cocina la merluza, la coliflor y las zanahorias (cortadas) al vapor hasta que estén tiernas. Al servir, rocía con el AOVE, sal y perejil.", "notes": "<strong style='color:#B8860B'>Guisantes con Jamón y Huevo</strong><br><span style='color:#B8860B'>Ingredientes:</span> 200g de guisantes congelados, 50g de jamón serrano sin grasa visible, 2 huevos, 5g de AOVE.<br><span style='color:#B8860B'>Preparación:</span> En una sartén, saltea los guisantes con el jamón. Haz los huevos a la plancha. Sirve todo junto."} 
    ],
    "MIÉRCOLES": [
        {"meal": "DESAYUNO", "ingredients": "Avena con Huevo y Cacahuete: 80g avena, 2 huevos duros, 20g cacahuete en polvo, 200ml agua/leche vegetal.", "recipe": "Cocina la avena con agua/leche vegetal. Retira del fuego. Pica los huevos duros y añádelos a la avena junto con el cacahuete en polvo y canela. Mezcla bien.", "notes": ""},
        {"meal": "ALMUERZO", "ingredients": "Natilla Proteica Mercadona y Almendras: 1 Natilla Proteica Mercadona, 20g almendras.", "recipe": "Listo para consumir", "notes": ""},
        {"meal": "COMIDA", "ingredients": "Pasta Carbonara \"Fit\": 120g pechuga de pavo, 50g pasta integral, 1 yema de huevo, 30g parmesano, 50g champiñones, 5g AOVE.", "recipe": "Cocina la pasta. En una sartén, saltea el pavo troceado y los champiñones laminados con 5g de AOVE. En un bol, bate la yema con el parmesano y un poco del agua de cocción de la pasta. Escurre la pasta, mézclala con el pavo y champiñones en la sartén. Fuera del fuego, añade la salsa de yema y remueve rápido para que se cree la salsa sin que cuaje el huevo.", "notes": "<strong style='color:#B8860B'>Ñoquis de Hacendado</strong><br><span style='color:#B8860B'>Ingredientes:</span> 150g de ñoquis de Hacendado, 150g de pollo o pavo picado, 3 cucharadas de tomate frito casero sin azúcar.<br><span style='color:#B8860B'>Preparación:</span> Cuece los ñoquis. Mientras, saltea el pollo picado en una sartén y añádele el tomate frito. Mezcla todo y sirve."},
        {"meal": "MERIENDA", "ingredients": "Yogur Griego y Crema Proteica: 180g yogur griego, 20g crema proteica.", "recipe": "Mezcla la crema proteica con el yogur griego.", "notes": ""},
        {"meal": "CENA", "ingredients": "Pulpo a la Gallega \"Fitness\": 200g pulpo cocido, 150g patatas cocidas, 10g AOVE, pimentón dulce, sal gorda.", "recipe": "Trocea el pulpo cocido y las patatas cocidas de bote. Saltea ambos en una sartén con 5g de AOVE para calentar. Sirve en un plato, espolvorea con pimentón y sal, y rocía generosamente con los otros 10g de AOVE.", "notes": ""}
    ],
    "JUEVES": [
        {"meal": "DESAYUNO", "ingredients": "Batido de Proteína con Cacahuete y Plátano: 1 scoop proteína, 20g cacahuete en polvo, 1 plátano, 250ml agua/leche vegetal.", "recipe": "Mezcla la proteína en polvo, el cacahuete en polvo y el plátano con agua/leche vegetal en una batidora hasta obtener una consistencia suave.", "notes": ""},
        {"meal": "ALMUERZO", "ingredients": "Batido Proteico Mercadona y Pavo Frío: 1 Batido Proteico Mercadona, 100g pechuga de pavo fría.", "recipe": "Listo para consumir", "notes": ""},
        {"meal": "COMIDA", "ingredients": "Poke Bowl de Atún: 200g lomo atún fresco, 100g quinoa (en crudo), 100g zanahoria rallada, 1/2 aguacate (100g), 15g AOVE, soja, sésamo. Salsa de yogur casera: 100g yogur griego natural, zumo de medio limón, 5g pasta de wasabi.", "recipe": "Cocina la quinoa. Cocina el atún en dados a la plancha/AirFryer (con 5g AOVE). En un bol, coloca la quinoa como base. Añade el atún, la zanahoria rallada y el aguacate troceado. Aliña con salsa de soja, sésamo y el resto del AOVE.", "notes": ""},
        {"meal": "MERIENDA", "ingredients": "Atún en Lata y Tortitas de Arroz: 1 lata atún al natural, 3 tortitas de arroz.", "recipe": "Listo para consumir", "notes": ""},
        {"meal": "CENA", "ingredients": "Pechuga de Pollo con Champiñones y Coliflor Salteadas: 200g pechuga de pollo, 250g champiñones, 250g coliflor, 10g AOVE.", "recipe": "Corta la pechuga de pollo en tiras o dados. Lava y corta los champiñones. En una sartén, saltea el pollo con 10g de AOVE hasta que esté cocido. Añade los champiñones y el ajo picado, cocina unos minutos. Incorpora la coliflor congelada directamente. Al servir, rocía con los otros 5g de AOVE.", "notes": "<strong style='color:#B8860B'>Pollo picante con cuscús</strong><br><span style='color:#B8860B'>Ingredientes:</span> 150g de pechuga de pollo cortada en dados, 50g de cuscús, verduras al gusto (calabacín, pimiento, cebolla), 5g de AOVE, especias picantes.<br><span style='color:#B8860B'>Preparación:</span> Prepara el cuscús. Saltea las verduras y el pollo. Mezcla con el cuscús y las especias."} 
    ],
    "VIERNES": [
        {"meal": "DESAYUNO", "ingredients": "Avena Proteica con Crema de Cacahuete y Fresas: 60-80g avena, 1 scoop proteína, 20g crema de cacahuete, 50g fresas, 200ml agua/leche vegetal.", "recipe": "Calienta la avena con agua/leche vegetal. Retira del fuego, añade la proteína en polvo y mezcla. Incorpora la crema de cacahuete y las fresas cortadas por encima.", "notes": ""},
        {"meal": "ALMUERZO", "ingredients": "Yogur Proteico Mercadona y Nueces: 1 Yogur Proteico Mercadona, 10g nueces.", "recipe": "Listo para consumir", "notes": ""},
        {"meal": "COMIDA", "ingredients": "Atún Congelado a la Plancha con Arroz Integral y Brócoli: 200g lomo de atún, 80g arroz integral (crudo), 200-300g brócoli, 10g AOVE.", "recipe": "Cocina el arroz integral según las instrucciones. Corta el brócoli en floretes. Sazona el lomo de atún con sal y limón, rocía con 5g de AOVE y cocina a la plancha al punto deseado. Saltea el brócoli con los otros 5g de AOVE o cuécelo al vapor. Sirve todo junto.", "notes": "<strong style='color:#B8860B'>Guiso de Lentejas con Pavo y Verduras</strong><br><span style='color:#B8860B'>Ingredientes:</span> 100g de lentejas pardinas (en crudo), 150g de pavo picado, 150g de verduras para guiso (zanahoria, cebolla, pimiento), 5g de AOVE, especias.<br><span style='color:#B8860B'>Preparación:</span> Sofríe las verduras en la Thermomix, añade el pavo picado y sofríe un poco más. Añade las lentejas, agua y especias. Cocina a 100°C, velocidad cuchara, durante 30-40 minutos."},
        {"meal": "MERIENDA", "ingredients": "Batido de Proteína y Plátano: 1 scoop proteína, agua.", "recipe": "Mezcla la proteína en polvo con agua en un shaker. Consume el batido y el plátano.", "notes": ""},
        {"meal": "CENA", "ingredients": "Nuggets Caseros \"Crunchy\" con Patatas en AirFryer y Salsa de Yogur: 200g pechuga de pollo, 15g pan rallado integral, especias , 100g patata cruda, 5g AOVE.10g para freidora/aliñar", "recipe": "(Receta Nuggets): Trocear pollo muy pequeño o picar. Mezclar con especias y pan rallado. Formar nuggets. Cocinar en AirFryer (20-25 min a 180°C) con 5g AOVE. (Receta Patatas): Preparar en AirFryer con 5g AOVE. (Receta Salsa): Mezclar ingredientes. Servir todo.)", "notes": "<strong style='color:#B8860B'>Delicias de patata y atún</strong><br><span style='color:#B8860B'>Ingredientes:</span> 200g de patata cocida y machacada, 1 lata de atún al natural (escurrido), 1 huevo, 10g de pan rallado integral, especias.<br><span style='color:#B8860B'>Preparación:</span> Mezcla todos los ingredientes en un bol. Forma las \"delicias\" o tortitas. Cocina en la AirFryer a 180°C durante 15-20 minutos, rociando con un poco de AOVE si lo necesitas."} 
    ],
    "SÁBADO": [
        {"meal": "DESAYUNO", "ingredients": "Avena con Huevo y Frutos Rojos: 60g avena, 2 huevos duros, 1 scoop proteína, 50g arándanos, 200ml agua/leche vegetal.", "recipe": "Cocina la avena con agua/leche vegetal. Retira del fuego. Pica los huevos duros y añádelos a la avena junto con la proteína en polvo, almendras y arándanos. Mezcla bien.", "notes": "<strong style='color:#B8860B'>Tortitas Proteicas con Plátano y Frutos Rojos</strong><br><span style='color:#B8860B'>Ingredientes:</span> 30g de harina de avena, 1 huevo, 100ml de leche o bebida vegetal, 15g de proteína en polvo (sabor vainilla o chocolate), 1/2 plátano, un puñado de frutos rojos.<br><span style='color:#B8860B'>Preparación:</span> Mezcla todos los ingredientes líquidos. Añade la harina y la proteína. Cocina las tortitas en una sartén antiadherente con una gota de aceite. Sirve con el plátano y los frutos rojos por encima.<br><br><strong style='color:#B8860B'>Brownie Proteico de Chocolate y Cacahuete</strong><br><span style='color:#B8860B'>Ingredientes:</span> 30g de proteína en polvo (sabor chocolate), 30g de harina de avena, 1 huevo, 50g de compota de manzana sin azúcar, 5g de crema de cacahuete, 1 cucharadita de levadura.<br><span style='color:#B8860B'>Preparación:</span> Mezcla todos los ingredientes en un bol. Vierte en un recipiente pequeño apto para microondas. Cocina durante 2-3 minutos."}, 
        {"meal": "ALMUERZO", "ingredients": "Natilla Proteica Mercadona y almendras: 1 Natilla Proteica Mercadona, 20g almendras.", "recipe": "Listo para consumir", "notes": ""},
        {"meal": "COMIDA", "ingredients": "Pollo a la Plancha con Coliflor y Zanahoria al Vapor: 200g pechuga de pollo, 250g coliflor, 250g zanahoria, 5g AOVE.", "recipe": "Cocina el pollo a la plancha con 5g de AOVE y sazona. Cocina la coliflor y los zanahorias al vapor hasta que estén tiernos. Al servir, rocía las verduras con los otros 5g de AOVE, sal y especias.", "notes": ""},
        {"meal": "MERIENDA", "ingredients": "Yogur Griego y Crema Proteica: 180g yogur griego, 15g crema proteica.", "recipe": "Mezcla la crema proteica con el yogur griego.", "notes": ""},
        {"meal": "CENA", "ingredients": "Hamburguesa \"Guay\" con Lacón Ahumado y Patatas en AirFryer: 1 pan integral, 200g carne picada (95% magra), 30g queso light, 50g cebolla morada, 10-15g salsa Valentina, 10-15g mostaza, 50g lacón ahumado, 1 huevo a la plancha. 100g de patatas y 10g de AOVE", "recipe": "Mezcla las patatas en un bol con los 5g de AOVE, sal y especias. Colócalas en la AirFryer. Cocína la carne en una sartén con un chorrito mínimo de AOVE (o en la AirFryer si tienes espacio y prefieres menos grasa) hasta que esté al punto deseado. Sazona con sal y pimienta. En otra sartén pequeña, cocina el lacón ahumado en lonchas hasta que esté ligeramente crujiente. En esa misma sartén, haz el huevo a la plancha a tu gusto", "notes": "<strong style='color:#B8860B'>Tacos de pollo \"fit\"</strong><br><span style='color:#B8860B'>Ingredientes:</span> 200g de pechuga de pollo picada, 2 tortillas de maíz o trigo integral, 100g de verduras frescas (cebolla, pimiento, tomate), especias para tacos, 10g de AOVE.<br><span style='color:#B8860B'>Preparación:</span> Saltea el pollo picado en una sartén con el AOVE y las especias. Calienta las tortillas y rellena con el pollo y las verduras frescas.<br><br><strong style='color:#B8860B'>Pizza \"fit\" con base de pan integral</strong><br><span style='color:#B8860B'>Ingredientes:</span> 2 rebanadas de pan integral, 3 cucharadas de tomate natural triturado, 100g de pechuga de pavo en lonchas, 30g de queso bajo en grasa, verduras (champiñones, cebolla).<br><span style='color:#B8860B'>Preparación:</span> Usa las rebanadas de pan como base, añade el tomate, las lonchas de pavo, las verduras y el queso. Hornea o usa la AirFryer hasta que el queso se derrita.<br><br><strong style='color:#B8860B'>Cenas de Picoteo y Opciones Sociales</strong><br>Puedes combinar varias opciones, asegurándote de no exceder el total de calorías y macros de la cena que sustituyes.<br>Berberechos en lata al natural: Alta en proteínas, baja en calorías.<br>Gambas al ajillo: Excelente fuente de proteína. Usa solo 5-10g de AOVE.<br>Patatas en AirFryer: Corta las patatas finas y ásalas en la AirFryer sin apenas aceite. Una ración de 100g de patata tendrá 150 kcal.<br>Tostas de salmón ahumado: Usa pan integral y una porción moderada de salmón. Plato con grasas saludables y proteínas."} 
    ],
    "DOMINGO": [
        {"meal": "DESAYUNO", "ingredients": "Avena con Huevo y Frutos Rojos: 60g avena, 2 huevos duros, 1 scoop proteína, 10g almendras, 50g arándanos, 200ml agua/leche vegetal.", "recipe": "Cocina la avena con agua/leche vegetal. Retira del fuego. Pica los huevos duros y añádelos a la avena junto con la proteína en polvo, almendras y arándanos. Mezcla bien.", "notes": ""},
        {"meal": "ALMUERZO", "ingredients": "Queso Cottage: 150g queso cottage bajo en grasa.", "recipe": "Listo para consumir", "notes": ""},
        {"meal": "COMIDA", "ingredients": "Ensalada de Atún, Garbanzos y Huevo Cocido: Base de espinacas (150g), 100g zanahoria rallada, 1 lata de atún al natural (escurrido), 100g garbanzos cocidos (escurridos y enjuagados), 1 huevo cocido (duro), 15g AOVE, vinagre de manzana, sal.", "recipe": "Preparar una base con las espinacas y zanahoria rallada. Añadir el atún escurrido, los garbanzos cocidos y el huevo cocido picado. Mezclar todo en un bol. Aliñar con AOVE, vinagre de manzana y sal.", "notes": ""},
        {"meal": "MERIENDA", "ingredients": "Pechuga de Pavo Fría: 100g pechuga de pavo fría.", "recipe": "Listo para consumir", "notes": ""},
        {"meal": "CENA", "ingredients": "Tortilla con Gambas o Pollo y Champiñones: 3 huevos enteros, 100g gambas/pollo, 200g champiñones, 10g AOVE.", "recipe": "Saltea las gambas o el pollo y los champiñones (cortados) con 10g de AOVE y ajo. Bate los huevos con sal y vierte sobre la mezcla en la sartén para hacer una tortilla. Rocía con los otros 5g de AOVE al servir.", "notes": "<strong style='color:#B8860B'>Guisantes con Jamón y Huevo</strong><br><span style='color:#B8860B'>Ingredientes:</span> 200g de guisantes congelados, 50g de jamón serrano sin grasa visible, 2 huevos, 5g de AOVE.<br><span style='color:#B8860B'>Preparación:</span> En una sartén, saltea los guisantes con el jamón. Haz los huevos a la plancha. Sirve todo junto."} 
    ]
  },
  "exercises": {
    "Lunes: Empuje (Pecho, Hombro, Tríceps)": [
      {"name": "Press de Banca con Barra", "weight": "44kg + 8Kg", "series": "4", "reps": "8-12", "description": "Desbloquea la barra. Baja controladamente la barra hacia la parte media/baja del pecho, manteniendo los codos ligeramente metidos hacia el cuerpo (no abiertos en cruz). La barra debe tocar ligeramente el pecho (o casi, sin rebotar). Empuja explosivamente hacia arriba, extendiendo los brazos sin bloquear completamente los codos al final.", "errors": "Rebote en el pecho, codos muy abiertos, levantar la cabeza o las caderas del banco, no controlar la bajada."},
      {"name": "Press de Banca Inclinado con Mancuernas", "weight": "15kg + 2Kg", "series": "3", "reps": "10-15", "description": "Empuja las mancuernas hacia arriba y ligeramente hacia adentro, hasta que se junten o casi se toquen en la parte superior. Baja controladamente, abriendo los codos ligeramente hacia los lados y hacia abajo, sintiendo el estiramiento en el pecho.", "errors": "Demasiada inclinación (convirtiéndose en press de hombros), no controlar la bajada, dejar caer los codos hacia atrás."},
      {"name": "Aperturas con Mancuernas", "weight": "13kg + 2Kg", "series": "3", "reps": "12-15", "description": "Abre los brazos hacia los lados en un amplio arco, como si quisieras abrazar un gran árbol, sintiendo el estiramiento profundo en el pecho. Cuando las mancuernas estén a la altura de tus hombros (o un poco más abajo si tu flexibilidad lo permite sin forzar el hombro), invierte el movimiento y cierra los brazos, contrayendo el pecho al final.", "errors": "Flexionar y extender los codos (convirtiéndolo en press), usar demasiado peso y perder el control, no sentir el estiramiento en el pecho."},
      {"name": "Press Militar con Barra de Pie", "weight": "24kg + 8kg", "series": "3", "reps": "8-12", "description": "Empuja la barra verticalmente hacia arriba, justo por encima de la cabeza, extendiendo los brazos sin bloquear los codos. Baja controladamente la barra a la posición inicial.", "errors": "Arquear excesivamente la espalda baja, empujar la barra hacia adelante en lugar de recta hacia arriba, usar demasiado impulso con las piernas (si es de pie)."},
      {"name": "Elevaciones Laterales con Mancuernas", "weight": "8kg + 2Kg + 2", "series": "3", "reps": "12-15", "description": "Levanta los brazos hacia los lados, con los codos ligeramente flexionados, como si quisieras \"verter agua de una jarra\", llevando los meñiques ligeramente más altos que los pulgares. Sube solo hasta la altura de los hombros. Baja controladamente.", "errors": "Usar demasiado peso y balancearse, encoger los hombros hacia las orejas, subir los brazos por encima de la altura del hombro."},
      {"name": "Extensiones de Tríceps con Barra Z por encima de la cabeza", "weight": "20kg + 6Kg + 4", "series": "3", "reps": "10-15", "description": "Flexiona los codos lentamente para bajar la barra por detrás de la cabeza, sintiendo el estiramiento en los tríceps. Extiende los brazos para subir la barra, contrayendo fuertemente los tríceps en la parte superior. Mantén los codos lo más estáticos posible.", "errors": "Abrir los codos hacia los lados, usar demasiado peso y balancear el cuerpo."},
      {"name": "Fondos en Banco (para tríceps)", "weight": "", "series": "3", "reps": "al fallo o 10-15", "description": "Siéntate en el borde de un banco, manos a los lados de las caderas, dedos hacia adelante. Desliza las caderas del banco, baja el cuerpo flexionando los codos (que deben apuntar hacia atrás, no hacia los lados) hasta que los brazos formen un ángulo de 90 grados. Empuja hacia arriba con los tríceps. Para más dificultad, puedes apoyar los pies en otro banco.", "errors": "Abrir los codos hacia los lados, no bajar lo suficiente o bajar demasiado rápido, usar demasiada ayuda de las piernas."} 
    ],
    "Martes: Piernas y Core / Entrenamiento Funcional": [
      {"name": "Sentadilla con Barra", "weight": "20", "series": "3-4", "reps": "8-12", "description": "Inicia el movimiento bajando las caderas como si te fueras a sentar en una silla. Baja hasta que tus muslos estén paralelos al suelo o más abajo si tu movilidad lo permite. Las rodillas deben seguir la dirección de las puntas de tus pies. Empuja desde los talones para subir, extendiendo caderas y rodillas simultáneamente.", "errors": "Arquear la espalda baja excesivamente, rodillas que se meten hacia adentro, no bajar lo suficiente, levantar los talones del suelo."},
      {"name": "Peso Muerto Rumano con Mancuernas", "weight": "15", "series": "3", "reps": "10-15", "description": "Inicia el movimiento inclinándote hacia adelante desde las caderas, no desde la cintura. Baja las mancuernas por las piernas, manteniendo la espalda recta y sintiendo el estiramiento en la parte posterior de los muslos (isquiotibiales). Baja hasta que sientas un buen estiramiento o hasta que las mancuernas estén a la altura de las tibias (o un poco más abajo si mantienes la forma). Vuelve a subir apretando los glúteos, sin hiperextender la espalda al final.", "errors": "Redondear la espalda, flexionar demasiado las rodillas (convirtiéndolo en sentadilla), no sentir el estiramiento en los isquiotibiales."},
      {"name": "Zancadas con Mancuernas (Alternas)", "weight": "10", "series": "3", "reps": "10-12 por pierna", "description": "Da un paso largo hacia adelante con una pierna. Baja la cadera hasta que ambas rodillas formen un ángulo de 90 grados. La rodilla de atrás debe apuntar hacia el suelo (sin tocarlo), y la rodilla de adelante no debe sobrepasar la punta del pie. Empuja con la pierna de adelante para volver a la posición inicial. Alterna las piernas.", "errors": "Paso demasiado corto (rodilla de adelante se va muy lejos), balancearse, perder el equilibrio."},
      {"name": "Puente de Glúteo (Glute Bridge) con Peso", "weight": "10", "series": "3", "reps": "15-20", "description": "Eleva las caderas del suelo apretando fuertemente los glúteos, hasta que tu cuerpo forme una línea recta desde los hombros hasta las rodillas. Mantén la contracción un segundo en la parte superior. Baja controladamente.", "errors": "Arquear la espalda baja en lugar de usar los glúteos, no contraer los glúteos en la parte superior."},
      {"name": "Plancha Lateral", "weight": "", "series": "3", "reps": "30-45 segundos por lado", "description": "Mantén el core apretado, los glúteos contraídos. Evita que la cadera caiga o se eleve demasiado.", "errors": "Dejar caer la cadera, hundir el hombro, no mantener una línea recta."},
      {"name": "Rodillo Abdominal", "weight": "", "series": "3", "reps": "10-15", "description": "Rueda el rodillo hacia adelante, extendiendo el cuerpo, manteniendo el core apretado y la espalda recta. No dejes que la espalda se arquee. Extiéndete lo más que puedas controladamente. Vuelve a la posición inicial contrayendo fuertemente los abdominales.", "errors": "Arquear la espalda baja, no controlar la vuelta, extenderse demasiado sin tener la fuerza para volver."} 
    ],
    "Miércoles: Tirón (Espalda, Bíceps, Trapecios)": [
      {"name": "Dominadas (Agarre Prono, Ancho)", "weight": "", "series": "3", "reps": "al fallo", "description": "Tira de ti mismo hacia arriba, llevando el pecho hacia la barra, enfocándote en tirar con la espalda (imagina llevar los codos hacia tus caderas). Sube hasta que la barbilla supere la barra. Baja controladamente, estirando los brazos completamente.", "errors": "Usar el impulso de las piernas, no subir lo suficiente, no bajar del todo, encoger los hombros."},
      {"name": "Remo con Barra (Pendlay Row o similar)", "weight": "34kg + 8kg", "series": "4", "reps": "8-12", "description": "Tira de la barra explosivamente hacia tu abdomen bajo, apretando los omóplatos. La barra debe tocar tu abdomen. Baja controladamente la barra al suelo en cada repetición (Pendlay).", "errors": "Redondear la espalda, no bajar la barra del todo, usar el impulso del cuerpo."},
      {"name": "Remo con Mancuernas a una Mano", "weight": "15Kg + 2Kg", "series": "3", "reps": "10-15 por brazo", "description": "Tira de la mancuerna hacia tu cadera, elevando el codo hacia el techo y apretando el omóplato. Siente la contracción en la espalda. Baja controladamente, estirando completamente el brazo.", "errors": "Redondear la espalda, rotar excesivamente el torso, usar impulso."},
      {"name": "Face Pull (con banda de resistencia)", "weight": "", "series": "3", "reps": "15-20", "description": "Tira de la banda/peso hacia tu cara, separando las manos y llevando los codos hacia atrás y hacia los lados. Concéntrate en apretar la parte trasera de los hombros (deltoides posteriores) y los omóplatos.", "errors": "Usar demasiado peso, encoger los hombros, no sentir el trabajo en la parte trasera del hombro."},
      {"name": "Curl de Bíceps con Barra Z", "weight": "20kg + 6Kg", "series": "3", "reps": "10-15", "description": "Flexiona los codos para subir la barra hacia los hombros, contrayendo el bíceps. Mantén los codos fijos y no uses el impulso de la espalda. Baja controladamente, estirando completamente los brazos.", "errors": "Balancear el cuerpo, separar los codos del cuerpo, no bajar del todo."},
      {"name": "Martillo con Mancuernas", "weight": "10kg + 2Kg", "series": "3", "reps": "10-15", "description": "Flexiona los codos para subir las mancuernas hacia los hombros, manteniendo las palmas enfrentadas (como si estuvieras martillando). Baja controladamente.", "errors": "Similar al curl de bíceps, balancear el cuerpo."},
      {"name": "Encogimientos de Hombros con Mancuernas", "weight": "20kg + 2Kg", "series": "3", "reps": "15-20", "description": "Encoge los hombros directamente hacia las orejas, sintiendo la contracción en los trapecios. Mantén la posición un segundo. Baja controladamente, estirando los trapecios.", "errors": "Girar los hombros, usar demasiado peso y balancear, no sentir la contracción en los trapecios."} 
    ],
    "Jueves: Torso Superior Enfocado (Variedad y Volumen)": [
      {"name": "Press de Banca Declinado con Barra", "weight": "40 + 8Kg", "series": "3", "reps": "8-12", "description": "Baja la barra hacia la parte inferior del pecho y empuja hacia arriba. El ángulo declinado enfatiza la parte inferior del pecho. Si haces press plano, la técnica es la misma que el lunes.", "errors": "No controlar la bajada, dejar que los codos se abran demasiado."},
      {"name": "Press de Hombros con Mancuernas (sentado)", "weight": "13KG", "series": "3", "reps": "10-15", "description": "Empuja las mancuernas verticalmente hacia arriba, extendiendo los brazos sin bloquear los codos. Baja controladamente a la altura de los hombros.", "errors": "Arquear la espalda, balancear el cuerpo, dejar caer las mancuernas rápidamente."},
      {"name": "Fondos en Paralelas", "weight": "", "series": "3", "reps": "al fallo o 10-15", "description": "Baja el cuerpo flexionando los codos. Para enfocar el pecho, inclínate ligeramente hacia adelante y deja que los codos se abran un poco. Para tríceps, mantente más recto y pega los codos al cuerpo. Baja hasta un estiramiento cómodo en el pecho/hombro. Empuja para subir.", "errors": "No controlar la bajada, no bajar lo suficiente, usar impulso."},
      {"name": "Remo al Mentón con Barra Z", "weight": "20 + 6 Kg", "series": "3", "reps": "12-15", "description": "Tira de la barra hacia tu mentón, elevando los codos por encima de la barra. Concéntrate en usar la parte lateral de los hombros y los trapecios. Baja controladamente.", "errors": "Usar demasiado peso y balancear el cuerpo, tirar con los bíceps, no elevar los codos."},
      {"name": "Aperturas Invertidas con Mancuernas", "weight": "5+ 2 Kg", "series": "3", "reps": "15-20", "description": "Levanta los brazos hacia los lados, como si volaras, llevando las mancuernas hacia el techo. Concéntrate en apretar la parte trasera de los hombros y los omóplatos. Baja controladamente.", "errors": "Usar demasiado peso y balancear, encoger los hombros, no sentir el trabajo en la parte trasera del hombro."},
      {"name": "Curl de Bíceps Concentrado con Mancuerna", "weight": "8+ 2 Kg", "series": "3", "reps": "10-15 por brazo", "description": "Sube la mancuerna hacia el hombro, contrayendo el bíceps de forma aislada. Mantén el codo firmemente apoyado y el resto del cuerpo inmóvil. Baja muy lentamente, controlando la fase excéntrica.", "errors": "Usar impulso, no controlar la fase negativa, no estirar el brazo del todo."},
      {"name": "Extensiones de Tríceps con una Mancuerna a dos manos", "weight": "20 + 2 Kg", "series": "3", "reps": "12-15", "description": "Flexiona los codos para bajar la mancuerna por detrás de la cabeza, estirando los tríceps. Extiende los brazos para subir, contrayendo fuertemente los tríceps.", "errors": "Abrir los codos, mover los hombros o la espalda para ayudar el movimiento."} 
    ],
    "Viernes: Empuje (Pecho, Hombro, Tríceps) - Segunda Sesión": [
      {"name": "Press de Banca con Mancuernas (Plano)", "weight": "15 + 2 Kg", "series": "4", "reps": "8-12", "description": "Empuja las mancuernas hacia arriba, extendiendo los brazos y contrayendo el pecho. Baja controladamente, permitiendo un estiramiento profundo del pecho (las mancuernas pueden ir ligeramente más allá del punto donde iría la barra).", "errors": "Dejar caer las mancuernas, perder el control del movimiento, no contraer el pecho."},
      {"name": "Press de Hombros con Barra", "weight": "24kg + 8kg", "series": "3", "reps": "8-12", "description": "Similar al lunes, pero puedes optar por la barra para variar el estímulo.", "errors": ""},
      {"name": "Cruces con Mancuernas en el suelo", "weight": "5 + 2 Kg", "series": "3", "reps": "12-15", "description": "Abre los brazos hacia los lados en un arco amplio, sintiendo el estiramiento en el pecho. Cierra las mancuernas sobre el pecho, contrayendo.", "errors": "Flexionar los codos demasiado, usar impulso, no sentir el estiramiento."},
      {"name": "Elevaciones Frontales con Mancuernas", "weight": "3 + 2 Kg", "series": "3", "reps": "12-15", "description": "Levanta los brazos rectos hacia adelante, hasta la altura de los hombros. No subas más arriba. Baja controladamente.", "errors": "Balancear el cuerpo, levantar los brazos por encima de los hombros, usar el trapecio."},
      {"name": "Press Cerrado con Barra (para tríceps)", "weight": "24 + 8 Kg", "series": "3", "reps": "10-15", "description": "Baja la barra hacia la parte baja del pecho, manteniendo los codos pegados al cuerpo. Empuja hacia arriba con los tríceps, bloqueando los codos al final.", "errors": "Abrir los codos, usar demasiado peso y balancear la barra."},
      {"name": "Extensiones de Tríceps con Mancuerna (a una mano)", "weight": "5 + 2 Kg", "series": "3", "reps": "12-15 por brazo", "description": "Flexiona el codo para bajar la mancuerna por detrás de la cabeza, sintiendo el estiramiento en el tríceps. Extiende para subir, contrayendo el tríceps.", "errors": "Abrir el codo hacia el lado, no controlar la bajada."} 
    ],
    "Sábado: Descanso Activo / Abdominales / Cardio": [
      {"name": "Abdominales con Rodillo Abdominal", "weight": "", "series": "3-4", "reps": "al fallo o 10-15 (controladas)", "description": "De rodillas, sujeta el rodillo. Rueda hacia adelante, extendiendo el cuerpo, manteniendo el core apretado y la espalda recta. Vuelve a la posición inicial.", "errors": ""},
      {"name": "Plancha Abdominal", "weight": "", "series": "3", "reps": "45-60 segundos", "description": "Apóyate en los antebrazos y las puntas de los pies, manteniendo el cuerpo recto como una tabla.", "errors": ""},
      {"name": "Elevaciones de Piernas colgado", "weight": "", "series": "3", "reps": "10-15", "description": "Cuélgate de la barra. Levanta las piernas rectas (o ligeramente flexionadas) hacia el pecho, contrayendo el abdomen. Baja controladamente.", "errors": ""},
      {"name": "Comba (Cardio)", "weight": "", "series": "1", "reps": "20-30 minutos", "description": "Salta la comba a un ritmo constante o realizando intervalos (ej. 1 minuto saltando, 30 segundos descansando).", "errors": ""}
    ]
  ,
    "Domingo: Descanso y Recuperación": [
      {
        "name": "Descanso Activo",
        "series": "N/A",
        "reps": "30-60 minutos",
        "weight": "Muy Ligero",
        "description": "El descanso es cuando el músculo crece y se repara. Este día es crucial. Realiza una actividad de muy baja intensidad como caminar a paso ligero, un paseo en bici suave o nadar. El objetivo es mover el cuerpo, aumentar el flujo sanguíneo y ayudar a la recuperación sin causar fatiga.",
        "errors": "Confundir descanso activo con un entrenamiento ligero. No debe ser un reto. Otro error común es la inactividad total; un poco de movimiento es mejor que nada para evitar la rigidez."
      },
      {
        "name": "Estiramientos Completos y Movilidad",
        "series": "1-2",
        "reps": "30-60s por estiramiento",
        "weight": "N/A",
        "description": "Dedica tiempo a estirar todos los grupos musculares trabajados durante la semana. Concéntrate en mantener estiramientos estáticos y suaves. Puedes incluir ejercicios de movilidad articular para mejorar el rango de movimiento.",
        "errors": "Forzar el estiramiento hasta sentir dolor, hacer rebotes, o no mantener la posición el tiempo suficiente. La paciencia es clave."
      },
      {
        "name": "Mindfulness y Preparación Mental",
        "series": "1",
        "reps": "10-15 minutos",
        "weight": "N/A",
        "description": "Dedica un momento a meditar o simplemente a respirar profundamente. Visualiza tus metas para la próxima semana, revisa tu progreso y refuerza tu compromiso. La preparación mental es tan importante como la física.",
        "errors": "Distraerse con el móvil, pensar que es una pérdida de tiempo, o no ser constante con la práctica."
      }
    ]
  },
  "progress": [
    { "week": 1, "actual": {"weight": 70.40, "fat": 16.50, "muscle": 33.79}, "targets": {"weight": 69.00, "fat": 17.00, "muscle": 33.1} },
    { "week": 2, "actual": {"weight": 68.90, "fat": 16.20, "muscle": 33.76}, "targets": {"weight": 68.70, "fat": 16.50, "muscle": 33.3} },
    { "week": 3, "actual": {"weight": 68.30, "fat": 16.00, "muscle": 34.15}, "targets": {"weight": 68.50, "fat": 15.90, "muscle": 33.6} },
    { "week": 4, "actual": {"weight": 69.30, "fat": 16.50, "muscle": 35.50}, "targets": {"weight": 68.30, "fat": 15.40, "muscle": 33.8} },
    { "week": 5, "actual": {"weight": 67.50, "fat": 15.70, "muscle": 34.76}, "targets": {"weight": 68.20, "fat": 14.90, "muscle": 34.1} },
    { "week": 6, "actual": {"weight": 67.60, "fat": 14.60, "muscle": 35.00}, "targets": {"weight": 68.00, "fat": 14.40, "muscle": 34.3} },
    { "week": 7, "actual": {"weight": 67.50, "fat": 14.20, "muscle": null}, "targets": {"weight": 67.90, "fat": 14.00, "muscle": 34.6} },
    { "week": 8, "actual": {"weight": null, "fat": null, "muscle": null}, "targets": {"weight": 67.80, "fat": 13.60, "muscle": 34.9} },
    { "week": 9, "actual": {"weight": null, "fat": null, "muscle": null}, "targets": {"weight": 67.70, "fat": 13.20, "muscle": 35.2} },
    { "week": 10, "actual": {"weight": null, "fat": null, "muscle": null}, "targets": {"weight": 67.60, "fat": 12.80, "muscle": 35.5} },
    { "week": 11, "actual": {"weight": null, "fat": null, "muscle": null}, "targets": {"weight": 67.50, "fat": 12.40, "muscle": 35.8} },
    { "week": 12, "actual": {"weight": null, "fat": null, "muscle": null}, "targets": {"weight": 67.40, "fat": 12.00, "muscle": 36.1} },
    { "week": 13, "actual": {"weight": null, "fat": null, "muscle": null}, "targets": {"weight": 67.30, "fat": 11.60, "muscle": 36.3} },
    { "week": 14, "actual": {"weight": null, "fat": null, "muscle": null}, "targets": {"weight": 67.20, "fat": 11.20, "muscle": 36.6} },
    { "week": 15, "actual": {"weight": null, "fat": null, "muscle": null}, "targets": {"weight": 67.10, "fat": 10.80, "muscle": 36.9} },
    { "week": 16, "actual": {"weight": null, "fat": null, "muscle": null}, "targets": {"weight": 67.00, "fat": 10.00, "muscle": 37.2} } 
  ],
  "muscleMeasurements": [
    { "week": 1, "actual": {"biceps": 33.7, "shoulder": 115.7, "chest": 97.0, "abdomen": 80.3}, "targets": {"biceps": 33.7, "shoulder": 115.7, "chest": 97.0, "abdomen": 80.3} },
    { "week": 2, "actual": {"biceps": 33.7, "shoulder": 118.0, "chest": 97.0, "abdomen": 79.4}, "targets": {"biceps": 33.7, "shoulder": 115.7, "chest": 97.0, "abdomen": 79.8} },
    { "week": 3, "actual": {"biceps": 33.8, "shoulder": 116.0, "chest": 97.9, "abdomen": 79.3}, "targets": {"biceps": 33.8, "shoulder": 115.8, "chest": 97.2, "abdomen": 79.5} },
    { "week": 4, "actual": {"biceps": 33.9, "shoulder": 117.5, "chest": 99.0, "abdomen": 79.0}, "targets": {"biceps": 33.9, "shoulder": 116.0, "chest": 97.4, "abdomen": 79.2} },
    { "week": 5, "actual": {"biceps": 34.0, "shoulder": 117.0, "chest": 99.6, "abdomen": 78.2}, "targets": {"biceps": 34.0, "shoulder": 116.4, "chest": 97.8, "abdomen": 78.6} },
    { "week": 6, "actual": {"biceps": 34.0, "shoulder": 117.0, "chest": 99.6, "abdomen": 78.2}, "targets": {"biceps": 34.1, "shoulder": 116.4, "chest": 97.8, "abdomen": 78.6} },
    { "week": 7, "actual": {"biceps": 34.0, "shoulder": 117.3, "chest": 98.7, "abdomen": 78.2}, "targets": {"biceps": 34.2, "shoulder": 116.6, "chest": 98.0, "abdomen": 78.3} },
    { "week": 8, "actual": {"biceps": null, "shoulder": null, "chest": null, "abdomen": null}, "targets": {"biceps": 34.3, "shoulder": 116.8, "chest": 98.2, "abdomen": 78.0} },
    { "week": 9, "actual": {"biceps": null, "shoulder": null, "chest": null, "abdomen": null}, "targets": {"biceps": 34.4, "shoulder": 117.0, "chest": 98.4, "abdomen": 77.7} },
    { "week": 10, "actual": {"biceps": null, "shoulder": null, "chest": null, "abdomen": null}, "targets": {"biceps": 34.5, "shoulder": 117.2, "chest": 98.6, "abdomen": 77.4} },
    { "week": 11, "actual": {"biceps": null, "shoulder": null, "chest": null, "abdomen": null}, "targets": {"biceps": 34.6, "shoulder": 117.4, "chest": 98.8, "abdomen": 77.1} },
    { "week": 12, "actual": {"biceps": null, "shoulder": null, "chest": null, "abdomen": null}, "targets": {"biceps": 34.7, "shoulder": 117.6, "chest": 99.0, "abdomen": 76.8} },
    { "week": 13, "actual": {"biceps": null, "shoulder": null, "chest": null, "abdomen": null}, "targets": {"biceps": 34.8, "shoulder": 117.8, "chest": 99.2, "abdomen": 76.5} },
    { "week": 14, "actual": {"biceps": null, "shoulder": null, "chest": null, "abdomen": null}, "targets": {"biceps": 34.9, "shoulder": 118.0, "chest": 99.4, "abdomen": 76.2} },
    { "week": 15, "actual": {"biceps": null, "shoulder": null, "chest": null, "abdomen": null}, "targets": {"biceps": 35.0, "shoulder": 118.2, "chest": 99.6, "abdomen": 75.9} },
    { "week": 16, "actual": {"biceps": null, "shoulder": null, "chest": null, "abdomen": null}, "targets": {"biceps": 35.1, "shoulder": 118.4, "chest": 99.8, "abdomen": 75.6} } 
  ]
}